In [1]:
import pandas as pd

In [24]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [25]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

#### loc(), iloc()

iloc(integer location): 정수 기반 위치 인덱싱
iloc은 정수 기반의 위치 인덱싱을 사용하여 데이터를 선택합니다.
인덱스의 순서를 기반으로 데이터에 접근합니다.
시작 인덱스는 0부터 시작합니다.
슬라이싱을 사용하여 특정 범위의 행과 열을 선택할 수 있습니다.

loc(location): 레이블 기반 인덱싱
loc은 레이블 기반 인덱싱을 사용하여 데이터를 선택합니다.
인덱스의 레이블을 기반으로 데이터에 접근합니다.
레이블을 사용하여 특정 행과 열을 선택하거나 조건에 맞는 행을 필터링할 수 있습니다.

기본 형태 instance[ ] 안에
1) 개별 지정 선택(단일, 다수)을 하는 경우의 형식은 리스트 사용

2) 범위 선택을 하는 경우 [start:end:step]의 형태를 사용

In [26]:
label1 = df.loc['서준']    # loc 인덱서 활용
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [27]:
label2 = df.loc[['서준', '인아']]
label2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [28]:
# columns의 이름을 이용해서 범위를 잡는건 꽤 놀라움, columns 또는 인덱스로 정렬된 데이터에서는 사용하기 좋을 것 같음
label3 = df.loc['서준':'인아']
label3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [7]:
position1 = df.iloc[0]     # iloc 인덱서 활용
position1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [16]:
# 범위 지정 선택
position3 = df.iloc[0:2]
position3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [14]:
# 개별 지정 선택
position4 = df.iloc[[0,2]]
position4

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [31]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

#### 범위를 잡거나 지정을 하는건 index 형태로 설정되어 있다면 가능함

In [32]:
df.loc[[0,2]]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

#### 개별 행을 꺼내면 Series 형태로 반환

In [34]:
math1 = df['수학']
print(type(math1))
math1

<class 'pandas.core.series.Series'>

0    90
1    80
2    70
Name: 수학, dtype: int64

#### 다수 행부터는 DataFrame

In [35]:
# '음악', '체육' 점수 데이터를 선택. 변수 music_gym 에 저장
music_gym = df[['음악', '체육']]
print(type(music_gym))
music_gym

<class 'pandas.core.frame.DataFrame'>

    음악   체육
0   85  100
1   95   90
2  100   90

#### 단일 행을 꺼내더라도 DataFrame형태로 가져올 수 있음

In [36]:
math2 = df[['수학']]
print(type(math2))
math2

<class 'pandas.core.frame.DataFrame'>

   수학
0  90
1  80
2  70

In [50]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

####  set_index는 columns에서 기본키를 지정해서 행 구분으로 내린다고 생각하면 될 듯

In [51]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [45]:
# 이런 경우도 가능
df_ex = df.set_index('수학', inplace=False)
df_ex

    이름  영어   음악   체육
수학
90  서준  98   85  100
80  우현  89   95   90
70  인아  95  100   90

In [48]:
df.index

RangeIndex(start=0, stop=3, step=1)

####  단일 데이터 지정

In [52]:
a = df.loc['서준', '음악']
a

85

In [53]:
b = df.iloc[0, 2]
print(b)

85

####  단일 데이터 지정 후 하위 데이터 범위 지정

In [54]:
d = df.iloc[0, 2:3]
print(d)

음악    85
Name: 서준, dtype: int64

In [57]:
# '서준' 지정 후 하위의(해당 조건의) 음악 ~ 체육 지정
e = df.loc['서준', '음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [58]:
f = df.iloc[0, 2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

#### 객체(열, 행) 의 형식을 사용

In [59]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수) 
g = df.loc[['서준', '우현'], ['음악', '체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [60]:
h = df.iloc[[0, 1], [2, 3]]
print(h)

    음악   체육
이름
서준  85  100
우현  95   90

In [61]:
i = df.loc['서준':'우현', '음악':'체육']
print(i)

    음악   체육
이름
서준  85  100
우현  95   90

In [62]:
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90